run/NACA0012_AoA[0-3]_k-omega/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
Foil
{
    type empty;
    nFaces 1518;
    startFace 1041594;
}

Inlet
{
    type empty;
    nFaces 1196;
    startFace 1043112;
}

Sides
{
    type empty;
    nFaces 800;
    startFace 1044308;
}

Outlet
{
    type empty;
    nFaces 600;
    startFace 1045108;
}

bottomEmptyFaces
{
    type empty;
    nFaces 521286;
    startFace 1045708;
}

topEmptyFaces
{
    type empty;
    nFaces 521286;
    startFace 1566994;
}

)


// ************************************************************************* //
